app/views/trips/edit.html.erb

SELECT "drivers".* FROM "drivers"
---
    <%= f.label :driver_id %>
    <%= f.select :driver_id, Driver.all.map { |d| [d.name, d.id] } %>

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 621], ["LIMIT", 1]]
---
    <%= f.label :passenger_id %>
    <%= f.select :passenger_id, [Passenger.find(Trip.find_by(id: params[:id]).passenger_id).name] %>

SELECT "drivers".* FROM "drivers"
---
    <%= f.label :driver_id %>
    <%= f.select :driver_id, Driver.all.map { |d| [d.name, d.id] } %>

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    <%= f.label :passenger_id %>
    <%= f.select :passenger_id, [Passenger.find(Trip.find_by(id: params[:id]).passenger_id).name] %>