app/views/trips/index.html.erb

<% if params[:driver_id] %>
  <h2>Existing trips for <%= Driver.find_by(id: params[:driver_id]).name %></h2>
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

<% if params[:passenger_id] %>
  <h2>Existing trips for <%= Passenger.find_by(id: params[:passenger_id]).name %></h2>
---
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    <%= trip.date %>
    <%= Driver.find_by(id: trip.driver_id).name %>
    <%= Passenger.find_by(id: trip.passenger_id).name %>
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]