app/views/trips/show.html.erb

  <li><%= @trip.date %></li>
  <li><%= link_to Driver.find_by(id: @trip.driver_id).name, driver_path(id: @trip.driver_id) %></li>
  <li><%= link_to Passenger.find_by(id: @trip.passenger_id).name, passenger_path(id: @trip.passenger_id) %></li>
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]