app/views/passengers/show.html.erb


<% unrated_trip = Trip.where(passenger_id: @passenger.id, rating: nil) %>
---
SELECT  "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1 AND "trips"."rating" IS NULL ORDER BY "trips"."id" ASC LIMIT $2  [["passenger_id", 86], ["LIMIT", 1]]

<ul>
<% trips = Trip.where(passenger_id: @passenger.id) %>
---
SELECT "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 227]]

      <%= trip.date %>
      <%= link_to Driver.find_by(id: trip.driver_id).name, driver_path(Driver.find_by(id: trip.driver_id).id) %>
      <%= link_to Passenger.find_by(id: trip.passenger_id).name, passenger_path(@passenger.id) %>
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 206], ["LIMIT", 1]]