app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all.order(:name)
---
SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."name" ASC

  def show
    driver_id = params[:id]
    @driver = Driver.find_by(id: driver_id)
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def create
    @driver = Driver.new(driver_params)

    is_successful = @driver.save
---
INSERT INTO "drivers" ("name", "vin", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "(PLACEHOLDER) NOT A DRIVER"], ["vin", "NOT A VIN"], ["created_at", "2019-04-18 06:33:19.199589"], ["updated_at", "2019-04-18 06:33:19.199589"]]

  def destroy
    driver = Driver.find_by(id: params[:id])

    if driver.nil?
      head :not_found
    else
      trips = Trip.where(driver_id: driver.id)
      trips.each do |trip|
        trip.update(driver_id: 101)
      end
      driver.destroy
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 33]]
SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 38]]
UPDATE "trips" SET "driver_id" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["driver_id", 101], ["updated_at", "2019-04-18 06:47:30.576765"], ["id", 36]]
DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 38]]