app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers" ORDER BY "passengers"."name" ASC
---
  def index
    @passengers = Passenger.paginate(:page => params[:page], per_page: 20).order(:name)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def show
    passenger_id = params[:id]
    @passenger = Passenger.find_by(id: passenger_id)

INSERT INTO "passengers" ("name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "(PLACEHOLDER) NOT A PASSENGER"], ["phone_num", "NOT A NUMBER"], ["created_at", "2019-04-18 06:53:12.798570"], ["updated_at", "2019-04-18 06:53:12.798570"]]
---
  def create
    @passenger = Passenger.new(passenger_params)

    is_successful = @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 260], ["LIMIT", 1]]
---
  def edit
    @passenger = Passenger.find_by(id: params[:id])

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 206], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 206]]
UPDATE "trips" SET "passenger_id" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["passenger_id", 301], ["updated_at", "2019-04-18 06:55:08.663647"], ["id", 140]]
DELETE FROM "passengers" WHERE "passengers"."id" = $1  [["id", 206]]
---
  def destroy
    passenger = Passenger.find_by(id: params[:id])

    if passenger.nil?
      head :not_found
    else
      trips = Trip.where(passenger_id: passenger.id)
      trips.each do |trip|
        trip.update(passenger_id: 0)
      end
      passenger.destroy