app/controllers/trips_controller.rb

SELECT COUNT(*) FROM "drivers"
---
  def create
    offset = rand(Driver.count)