app/controllers/trips_controller.rb

  def show
    trip_id = params[:id]
    @trip = Trip.find_by(id: trip_id)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]

  def create
    chosen_driver = Driver.where(available: true).sample(1)
    @trip = Trip.new(
      date: Date.current,
      driver_id: chosen_driver.first.id,
      passenger_id: params[:passenger_id],
      cost: rand(100..30000),
      rating: nil,
    )

    is_successful = @trip.save

    if is_successful
      chosen_driver.first.available = false
      chosen_driver.first.save
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."available" = $1  [["available", true]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."available" = $1 LIMIT $2  [["available", true], ["LIMIT", 1]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "passenger_id", "driver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2019-04-19"], ["cost", 14475], ["created_at", "2019-04-19 18:33:24.277201"], ["updated_at", "2019-04-19 18:33:24.277201"], ["passenger_id", 48], ["driver_id", 69]]
SELECT  "drivers".* FROM "drivers" ORDER BY "drivers"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 12]]
UPDATE "drivers" SET "available" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["available", false], ["updated_at", "2019-04-19 18:33:24.324021"], ["id", 69]]

  def edit
    @trip = Trip.find_by(id: params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 622], ["LIMIT", 1]]

  def update
    @trip = Trip.find_by(id: params[:id])

    is_successful = @trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 621], ["LIMIT", 1]]
UPDATE "trips" SET "rating" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["rating", 2], ["updated_at", "2019-04-19 18:32:54.194837"], ["id", 621]]

  def destroy
    trip = Trip.find_by(id: params[:id])

    if trip.nil?
      head :not_found
    else
      trip.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 608], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 608]]