app/views/drivers/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 32]]
---
<ul>
<% trips = Trip.where(driver_id: @driver.id) %>

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 183], ["LIMIT", 1]]
---
      <%= trip.date %>
      <%= Driver.find_by(id: trip.driver_id).name %>
      <%= Passenger.find_by(id: trip.passenger_id).name %>