app/models/driver.rb

SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 32]]
SELECT COUNT(*) FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 32]]
---
  def average_rating
    sum = 0
    trips = Trip.where(driver_id: self.id)
    trips.each do |trip|
      sum += trip.rating
    end
    avg_rating = sum / trips.count

SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 32]]
---
  def total_earnings
    sum = 0
    trips = Trip.where(driver_id: self.id)
    trips.each do |trip|