app/models/passenger.rb

  def total_spent
    sum = 0
    trips = Trip.where(passenger_id: self.id)
    trips.each do |trip|
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]